---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledWidth
source: html/0311bde5-b7c0-b381-4981-d9bab8b9727a.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ScaledWidth Property

The width of the extrusion, scaled to the units of export.

## Syntax (C#)
```csharp
public double ScaledWidth { get; set; }
```